<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"meta","backend":"6a50943324211c38cf09f12b344af3ab7ae2aee780a38bea6f452003a40982d0","plan_job_ref":"Job Pull Request Checks #4960 at https://github.com/GSA-TTS/FAC/actions/runs/16453541077","plan_out_hash":"028b929e5b9d7f57e0afd30564773bec9858329ae5d9472a30f42640463d0569","plan_hash":"c05089b0f9c737e9c2708f2515a6cdf4e576cf388b7375ee2208007779b77206","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __meta__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.environments["dev"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry/cloudfoundry"
                  version = ">=1.7.0"
                }
                cloudfoundry-community = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
            
            # Backwards compatability provider
            # https://github.com/GSA-TTS/terraform-cloudgov/blob/main/UPGRADING.md#using-v1-and-v2-together
            provider "cloudfoundry-community" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../dev/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["preview"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry/cloudfoundry"
                  version = ">=1.7.0"
                }
                cloudfoundry-community = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
            
            # Backwards compatability provider
            # https://github.com/GSA-TTS/terraform-cloudgov/blob/main/UPGRADING.md#using-v1-and-v2-together
            provider "cloudfoundry-community" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../preview/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["production"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry/cloudfoundry"
                  version = ">=1.7.0"
                }
                cloudfoundry-community = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
            
            # Backwards compatability provider
            # https://github.com/GSA-TTS/terraform-cloudgov/blob/main/UPGRADING.md#using-v1-and-v2-together
            provider "cloudfoundry-community" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../production/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["staging"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry/cloudfoundry"
                  version = ">=1.7.0"
                }
                cloudfoundry-community = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
            
            # Backwards compatability provider
            # https://github.com/GSA-TTS/terraform-cloudgov/blob/main/UPGRADING.md#using-v1-and-v2-together
            provider "cloudfoundry-community" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../staging/providers-managed.tf"
+       id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4960](https://github.com/GSA-TTS/FAC/actions/runs/16453541077)